0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
    /* Starting CIPSEND is not delivery evidence; wait for SEND OK. */
    if (cipsend_tx_is_terminal(&g_cipsend_tx)) {
        terminal_tag = cipsend_tx_tag(&g_cipsend_tx);
        terminal_result = cipsend_tx_result(&g_cipsend_tx);
    }

    terminal_now_ms = mono_now_ms();

    /* Capture telemetry terminal timing before the coordinator can clear an
       in-flight batch on a CLOSED boundary. */
    if (terminal_tag == CIPSEND_TX_TAG_TELEMETRY
        && s_timing_telemetry_inflight) {
        if (terminal_result == CTS_RESULT_OK) {
            telemetry_delivery_mark_inflight_send_ok(&s_tele_delivery,
                                                     terminal_now_ms);
            s_timing_report.t_send_ok_ms = terminal_now_ms;
            s_timing_report.flags |= TIMING_DIAGNOSTIC_FLAG_SEND_OK;
        }
        s_timing_report.flags |= TIMING_DIAGNOSTIC_FLAG_TX_TERMINAL;
        s_timing_telemetry_inflight = 0U;
        if (terminal_result != CTS_RESULT_CLOSED) {
            s_timing_diag_pending = 1U;
        }
    }

    /* Delegates to the extracted pure-logic function in esp_tx_coordinator,
       which is Host-testable via the same production code path.  See
       tx_boundary_design_decision.md §4 and §9. */
    etc_handle_terminal(&g_coordinator, terminal_now_ms);

    /* Only SEND OK commits the in-flight telemetry prefix.  Error/timeout
       leaves it owned by telemetry_delivery for a same-connection retry;
       CLOSED has already cleared it through the coordinator callback. */
    if (terminal_tag == CIPSEND_TX_TAG_TELEMETRY
        && terminal_result == CTS_RESULT_OK) {
        telemetry_delivery_commit_success(&s_tele_delivery);
    } else if (terminal_tag == CIPSEND_TX_TAG_TELEMETRY
               && terminal_result != CTS_RESULT_CLOSED) {
        telemetry_delivery_retain_failure(&s_tele_delivery);
    }

    /* A pending clock sample remains retryable until the fixed-length
       response receives SEND OK.  Command acceptance, prompt receipt, and
       payload preparation are not delivery evidence. */
    if (terminal_tag == CIPSEND_TX_TAG_CLOCK_SYNC
        && terminal_result == CTS_RESULT_OK) {
        esp_transport_consume_pending_clock_sync();
    }

    if (imu_diagnostic_delivery_confirmed(terminal_tag, terminal_result)) {
        s_imu_diag_pending = 0U;
    }

    if (terminal_tag == CIPSEND_TX_TAG_TIMING_DIAGNOSTIC) {
        s_timing_diag_inflight = 0U;
        if (terminal_result != CTS_RESULT_OK
            && terminal_result != CTS_RESULT_CLOSED) {
            s_timing_diag_pending = 1U;
        }
    }
}

/* Phase 1: drain RX ring, route every byte to both the transport
   (CONNECT/CLOSED/+IPD) and the TX state machine ('>' / SEND OK parse). */
static void ESP_ServiceRX(void)
{
    UartRxRecord record;
    while (uart_ring_pop_record(&g_uart_ring, &record)) {
        uint32_t parse_observed_tick_ms = mono_now_ms();
        esp_transport_set_now_ms(parse_observed_tick_ms);
        esp_transport_process_byte_at(
            record.byte, record.observed_tick_ms, record.observed_valid,
            parse_observed_tick_ms);           /* CONNECT/CLOSED/+IPD 输入路径 */
        cipsend_tx_feed_byte(&g_cipsend_tx, record.byte); /* TX '>' / SEND OK */
    }
}

/* Start a pending clock response at the earliest safe dispatch point.  This
   fast lane is deliberately non-preemptive: ACK/STATUS remain ahead of it,
   and an already-started CIPSEND is never interrupted. */
static uint8_t ESP_TrySendClockSync(void)
{
    char cmd[24];
    uint32_t start_tick_ms;

    if (!g_tcp_client_connected || g_tcp_client_id > 4U) return 0U;
    if (!esp_transport_has_pending_clock_sync()) return 0U;
    if (cipsend_tx_busy(&g_cipsend_tx)) return 0U;
    if (txfq_has_retry(&g_tx_queue)
        || esp_transport_has_pending_ack()
        || esp_transport_has_pending_status()
        || twin_control_has_pending_status()) {
        return 0U;
    }

    start_tick_ms = mono_now_ms();
    if (!esp_transport_peek_pending_clock_sync(&s_clock_sync_inflight)) {
        return 0U;
    }
    s_clock_sync_inflight.t_transaction_started_tick_ms = start_tick_ms;
    s_clock_sync_inflight.t_transaction_started_timestamp_valid = 1U;
    build_cipsend_cmd(cmd, TWIN_CONTROL_CLOCK_SYNC_FRAME_LEN);
    if (!cipsend_tx_start_late_data(
            &g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
            TWIN_CONTROL_CLOCK_SYNC_FRAME_LEN, CIPSEND_TX_PRIORITY_CRITICAL,
            CIPSEND_TX_TAG_CLOCK_SYNC, start_tick_ms,
            fill_clock_sync_payload, &s_clock_sync_inflight)) {
        return 0U;
    }
    hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_CLOCK_SYNC,
                      start_tick_ms);
    return 1U;
}

/* Phase 2+3: check connection boundary, then push TX + handle terminal.
   Must run AFTER ESP_ServiceRX (which may have detected CONNECT/CLOSED)
   but BEFORE any main-loop logic that reads connection state. */
static void ESP_ServiceTX(void)
{
    uint32_t gen;
    /* Check boundary BEFORE pushing any TX bytes (see design decision §5).
       If a CONNECT arrived during ESP_ServiceRX, the coordinator discards
       the old CipsendTx, TX ring, tele slot, and A/S retry buffers so no
       old-epoch byte can reach the ESP. */
    (void)etc_check_boundary(&g_coordinator,
                             esp_transport_connection_generation(),
                             mono_now_ms());
    if (esp_transport_take_disconnect_event()) {
        reset_timing_diagnostic_state();
    }
    /* 连接代次变化 → 放弃旧代次待发健康帧（发送仲裁，不得发给新客户端）。 */
    gen = esp_transport_connection_generation();
    if (gen != s_last_tx_generation) {
        s_last_tx_generation = gen;
        esp_clock_quiet_reset(&s_clock_quiet);
        reset_timing_diagnostic_state();
        hstats_health_epoch_changed(&g_health_stats);
    }
    if (esp_transport_take_clock_sync_event()) {
        esp_clock_quiet_arm(&s_clock_quiet, mono_now_ms());
    }
    if (!g_tcp_client_connected || g_tcp_client_id > 4U) {
        esp_clock_quiet_reset(&s_clock_quiet);
    }
    cipsend_tx_tick(&g_cipsend_tx, mono_now_ms(), uart_tx_sink, NULL);
    ESP_TX_HandleTerminal();
}

/* 构建 31 字节遥测帧到 s_tele_frame（兼容旧 payload 布局）。 */
static void build_telemetry_frame(int16_t s0, int16_t s1, int16_t s2, int16_t s3,
                                   int16_t m1, int16_t m2, int16_t m3, int16_t m4,
                                   int16_t error, int16_t pid_output,
                                   uint32_t tick, int32_t yaw,
                                   uint8_t imu_validity)
{
    uint8_t type = 0x01;
    uint8_t len  = 26;
    uint8_t cs   = type ^ len;
    uint8_t i;
    int32_t yaw_int = yaw;

    s_tele_frame[4]  = (uint8_t)(s0 & 0xFF);
    s_tele_frame[5]  = (uint8_t)(s1 & 0xFF);
    s_tele_frame[6]  = (uint8_t)(s2 & 0xFF);
    s_tele_frame[7]  = (uint8_t)(s3 & 0xFF);
    s_tele_frame[8]  = (uint8_t)(m1 & 0xFF);        s_tele_frame[9]  = (uint8_t)((m1 >> 8) & 0xFF);
    s_tele_frame[10] = (uint8_t)(m2 & 0xFF);        s_tele_frame[11] = (uint8_t)((m2 >> 8) & 0xFF);
    s_tele_frame[12] = (uint8_t)(m3 & 0xFF);        s_tele_frame[13] = (uint8_t)((m3 >> 8) & 0xFF);
    s_tele_frame[14] = (uint8_t)(m4 & 0xFF);        s_tele_frame[15] = (uint8_t)((m4 >> 8) & 0xFF);
    s_tele_frame[16] = (uint8_t)(error & 0xFF);     s_tele_frame[17] = (uint8_t)((error >> 8) & 0xFF);
    s_tele_frame[18] = (uint8_t)(pid_output & 0xFF);s_tele_frame[19] = (uint8_t)((pid_output >> 8) & 0xFF);
    s_tele_frame[20] = (uint8_t)(tick & 0xFF);
    s_tele_frame[21] = (uint8_t)((tick >> 8) & 0xFF);
    s_tele_frame[22] = (uint8_t)((tick >> 16) & 0xFF);
    s_tele_frame[23] = (uint8_t)((tick >> 24) & 0xFF);
    s_tele_frame[24] = (uint8_t)(yaw_int & 0xFF);
    s_tele_frame[25] = (uint8_t)((yaw_int >> 8) & 0xFF);
    s_tele_frame[26] = (uint8_t)((yaw_int >> 16) & 0xFF);
    s_tele_frame[27] = (uint8_t)((yaw_int >> 24) & 0xFF);
    s_tele_frame[28] = imu_validity;
    s_tele_frame[29] = MPU6050_GetInitStatus();

    for (i = 4; i < 30; i++) cs ^= s_tele_frame[i];

    s_tele_frame[0] = 0xAA;
    s_tele_frame[1] = 0x55;
    s_tele_frame[2] = type;
    s_tele_frame[3] = len;
    s_tele_frame[30] = cs;
}

/* Build one low-rate report from the newest sample in the batch. The raw
   batch tick range still describes the whole payload sent in this transaction. */
static void timing_diag_fill_from_batch(
    TimingDiagnosticSnapshot *snapshot,
    const TelemetryBatch *batch,
    uint16_t batch_id,
    uint8_t pending_count,
    uint16_t overwrite_total,
    uint32_t tx_start_ms)
{
    const TelemetryTimingRecord *latest;
    uint8_t count;

