0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
    if (snapshot == NULL || batch == NULL) return;
    memset(snapshot, 0, sizeof(*snapshot));
    count = telemetry_batch_count(batch);
    if (count == 0U) return;

    latest = &batch->timing[count - 1U];
    snapshot->flags = TIMING_DIAGNOSTIC_FLAG_SAMPLE_VALID
                    | TIMING_DIAGNOSTIC_FLAG_TX_START;
    snapshot->batch_id = batch_id;
    snapshot->batch_count = count;
    snapshot->pending_count = pending_count;
    snapshot->overwrite_total = overwrite_total;
    snapshot->t_imu_start_ms = latest->t_imu_start_ms;
    snapshot->t_imu_done_ms = latest->t_imu_done_ms;
    snapshot->t_sensor_done_ms = latest->t_sensor_done_ms;
    snapshot->t_state_ms = latest->t_state_ms;
    snapshot->t_enqueue_ms = latest->t_enqueue_ms;
    snapshot->t_tx_start_ms = tx_start_ms;
    snapshot->batch_first_tick_ms = batch->timing[0].generation_tick_ms;
    snapshot->batch_last_tick_ms = latest->generation_tick_ms;
    snapshot->sample_seq = latest->sample_seq;
}

/* 尝试把待发遥测交给 TX 状态机（仅当空闲且无 critical 待发）。 */
static void ESP_TrySendTelemetry(void)
{
    char cmd[24];
    const TelemetryBatch *inflight;
    uint16_t batch_len;
    uint8_t pending_count;
    uint32_t tx_start_ms;
    if (!telemetry_delivery_has_data(&s_tele_delivery)) return;
    if (esp_transport_has_pending_clock_sync()) return;
    if (esp_clock_quiet_active(&s_clock_quiet, mono_now_ms())) return;
    if (hstats_health_due(&g_health_stats)) return;  /* 健康帧优先：让行（仲裁） */
    if (cipsend_tx_busy(&g_cipsend_tx)) return;
    if (twin_control_has_pending_status()) return;
    if (!etc_telemetry_dispatch_allowed(
            s_control_cycle_ready,
            txfq_has_retry(&g_tx_queue),
            esp_transport_has_pending_ack(),
            esp_transport_has_pending_status(),
            twin_control_has_pending_status())) {
        return;  /* A/S 优先, including frames queued later this loop */
    }
    if (!telemetry_delivery_prepare(&s_tele_delivery)) return;
    inflight = telemetry_delivery_inflight(&s_tele_delivery);
    if (inflight == NULL) return;
    batch_len = telemetry_batch_length(inflight);
    pending_count = telemetry_batch_count(&s_tele_delivery.pending);
    build_cipsend_cmd(cmd, batch_len);
    tx_start_ms = mono_now_ms();
    if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                         telemetry_batch_data(inflight), batch_len,
                         CIPSEND_TX_PRIORITY_DROPPABLE, CIPSEND_TX_TAG_TELEMETRY,
                         tx_start_ms)) {
        telemetry_delivery_mark_inflight_tx_start(&s_tele_delivery,
                                                  tx_start_ms);
        s_timing_batch_id++;
        timing_diag_fill_from_batch(&s_timing_report, inflight,
                                    s_timing_batch_id, pending_count,
                                    s_timing_overwrite_total, tx_start_ms);
        s_timing_telemetry_inflight = 1U;
        hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_TELEMETRY,
                          tx_start_ms);
    }
}

/* 遥测入队（pending FIFO）：由 ESP_TrySendTelemetry 择机批量发送。
   generation_tick_ms 在帧生成边界采集，不等同于传感器采样时刻。 */
static void Telemetry_Queue(int16_t s0, int16_t s1, int16_t s2, int16_t s3,
                            int16_t m1, int16_t m2, int16_t m3, int16_t m4,
                            int16_t error, int16_t pid_output,
                            int32_t yaw, uint8_t imu_validity)
{
    uint32_t generation_tick_ms;
    TelemetryTimingRecord timing;
    uint8_t overwrote;
    uint8_t appended;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) {
        telemetry_delivery_clear(&s_tele_delivery);
        return;
    }
    generation_tick_ms = mono_now_ms();
    timing = s_timing_work;
    timing.generation_tick_ms = generation_tick_ms;
    timing.t_state_ms = generation_tick_ms;
    timing.t_enqueue_ms = 0U;
    timing.t_tx_start_ms = 0U;
    timing.t_send_ok_ms = 0U;
    timing.sample_seq = ++s_timing_sample_seq;
    build_telemetry_frame(s0, s1, s2, s3, m1, m2, m3, m4,
                          error, pid_output, generation_tick_ms,
                          yaw, imu_validity);
    appended = telemetry_delivery_append_timed(
            &s_tele_delivery, s_tele_frame,
            TELEMETRY_BATCH_FRAME_SIZE, &timing, &overwrote);
    if (overwrote) {
        hstats_telemetry_overwritten(&g_health_stats);
        if (s_timing_overwrite_total != 0xFFFFU) {
            s_timing_overwrite_total++;
        }
    }
    if (!appended) return;
    {
        telemetry_delivery_mark_last_pending_enqueue(&s_tele_delivery,
                                                     mono_now_ms());
        hstats_telemetry_generated(&g_health_stats);
        ESP_TrySendTelemetry();
    }
}

/* 发送二进制诊断帧。0x7E 旧诊断帧可丢弃；0x7D IMU 身份诊断帧和
   0x7F 时序诊断帧走独立 tag。若 TX 忙则本次放弃。
   Health baseline: 0x02 健康帧走 CIPSEND_TX_TAG_DIAG_HEALTH（专属归属）；
   0x7E 旧诊断帧仍走 CIPSEND_TX_TAG_DIAG。返回是否成功开启事务（start
   成功处触发 hstats_tx_started；失败由调用方记 health_dropped）。 */
static uint8_t ESP_SendDiagFrame(const uint8_t *frame, uint16_t frame_len)
{
    uint8_t tag;
    uint8_t started;
    char cmd[24];
    uint32_t start_ms;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) return 0U;
    if (esp_transport_has_pending_clock_sync()) return 0U;
    if (esp_clock_quiet_active(&s_clock_quiet, mono_now_ms())) return 0U;
    if (cipsend_tx_busy(&g_cipsend_tx)) return 0U;
    if (twin_control_has_pending_status()) return 0U;
    if (txfq_has_retry(&g_tx_queue)) return 0U;
    if (esp_transport_has_pending_ack()
        || esp_transport_has_pending_status()) return 0U;
    if (frame_len >= 4U && frame[2] == HEALTH_FRAME_TYPE) {
        tag = CIPSEND_TX_TAG_DIAG_HEALTH;
    } else if (frame_len >= 4U && frame[2] == IMU_DIAGNOSTIC_TYPE) {
        tag = CIPSEND_TX_TAG_IMU_DIAGNOSTIC;
    } else if (frame_len >= 4U && frame[2] == TIMING_DIAGNOSTIC_TYPE) {
        tag = CIPSEND_TX_TAG_TIMING_DIAGNOSTIC;
    } else {
        tag = CIPSEND_TX_TAG_DIAG;
    }
    build_cipsend_cmd(cmd, frame_len);
    start_ms = mono_now_ms();
    started = cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                               frame, frame_len,
                               CIPSEND_TX_PRIORITY_DROPPABLE, tag,
                               start_ms);
    if (started) {
        hstats_tx_started(&g_health_stats, tag, start_ms);
    }
    return started;
}

static void ESP_TrySendImuDiagnostic(void)
{
    ImuDiagnosticSnapshot snapshot;
    uint8_t frame[IMU_DIAGNOSTIC_FRAME_SIZE];

    if (!s_imu_diag_pending) return;

    snapshot.observed_id = MPU6050_GetObservedID();
    snapshot.init_status = MPU6050_GetInitStatus();
    snapshot.validity_flags = MPU6050_GetValidityFlags();
    snapshot.hardware_observed_id = MPU6050_GetHardwareObservedID();
    imu_diagnostic_encode(frame, &snapshot);

    /* Keep the pending flag on a busy/disconnected/blocked transport so the
       identity is still sent when the existing client path becomes idle. */
    (void)ESP_SendDiagFrame(frame, IMU_DIAGNOSTIC_FRAME_SIZE);
}

