0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
/* Emit at most one timing report per second so the diagnostic stream does
   not become another source of persistent queue pressure. */
static void ESP_TrySendTimingDiagnostic(void)
{
    uint32_t now_ms;
    uint8_t frame[TIMING_DIAGNOSTIC_FRAME_SIZE];

    if (!s_timing_diag_pending || s_timing_diag_inflight) return;
    if (hstats_health_due(&g_health_stats)) return;
    now_ms = mono_now_ms();
    if ((uint32_t)(now_ms - s_last_timing_diag_ms)
            < TIMING_DIAGNOSTIC_PERIOD_MS) {
        return;
    }
    if (timing_diagnostic_encode(frame, &s_timing_report)
            != TIMING_DIAGNOSTIC_FRAME_SIZE) return;
    if (ESP_SendDiagFrame(frame, TIMING_DIAGNOSTIC_FRAME_SIZE)) {
        s_last_timing_diag_ms = now_ms;
        s_timing_diag_pending = 0U;
        s_timing_diag_inflight = 1U;
    }
}

/* 发送队列（非阻塞）：ACK → STATUS → ClockSync → telemetry，严格串行。
   每次只尝试开启一个事务；失败时 critical 重试缓冲保留到下一轮。
   critical 帧的可靠性只在当前连接代次内保证：跨连接（代次改变 /
   CLOSED）时旧 ACK/STATUS 会被 txfq 丢弃，不会发给新客户端。 */
static void ESP_SendQueuedFrames(uint8_t allow_telemetry)
{
    char cmd[24];
    uint8_t ack_was_retained;
    uint8_t status_was_retained;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) return;
    if (cipsend_tx_busy(&g_cipsend_tx)) return;

    /* --- ACK: retry existing or fetch new from transport ---
       Health baseline: 取新帧前 txfq_has_ack 已真 = 重发（上笔非 OK 终态）→
       hstats_ack_retry。 */
    ack_was_retained = txfq_has_ack(&g_tx_queue);
    if (!ack_was_retained && esp_transport_has_pending_ack()) {
        char tmp[TX_FRAME_QUEUE_LINE_MAX + 1U];
        uint16_t n = esp_transport_get_pending_ack(tmp, sizeof(tmp));
        txfq_retain_ack(&g_tx_queue, tmp, n);
    }
    if (txfq_has_ack(&g_tx_queue)) {
        if (ack_was_retained) hstats_ack_retry(&g_health_stats);
        build_cipsend_cmd(cmd, txfq_ack_len(&g_tx_queue));
        if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                             (const uint8_t *)txfq_ack_ptr(&g_tx_queue),
                             txfq_ack_len(&g_tx_queue),
                             CIPSEND_TX_PRIORITY_CRITICAL, CIPSEND_TX_TAG_ACK,
                             mono_now_ms())) {
            hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_ACK, mono_now_ms());
        }
        return;   /* 保持 ACK 顺序：STATUS 延后 */
    }

    /* --- STATUS: retry existing or fetch new from transport --- */
    status_was_retained = txfq_has_status(&g_tx_queue);
    if (!status_was_retained && esp_transport_has_pending_status()) {
        char tmp[TX_FRAME_QUEUE_LINE_MAX + 1U];
        uint16_t n = esp_transport_get_pending_status(tmp, sizeof(tmp));
        txfq_retain_status(&g_tx_queue, tmp, n);
    }
    if (txfq_has_status(&g_tx_queue)) {
        if (status_was_retained) hstats_status_retry(&g_health_stats);
        build_cipsend_cmd(cmd, txfq_status_len(&g_tx_queue));
        if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                             (const uint8_t *)txfq_status_ptr(&g_tx_queue),
                             txfq_status_len(&g_tx_queue),
                             CIPSEND_TX_PRIORITY_CRITICAL, CIPSEND_TX_TAG_STATUS,
                             mono_now_ms())) {
            hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_STATUS, mono_now_ms());
        }
        return;
    }

    /* --- Clock sync response: after safety frames, before telemetry --- */
    if (esp_transport_has_pending_clock_sync()) {
        (void)ESP_TrySendClockSync();
        return;
    }

    /* --- Telemetry (FIFO pending queue) --- */
    if (allow_telemetry) ESP_TrySendTelemetry();
}

/******************************************************************************
 * 以下为小车_改原封不动的算法 + 参数
 ******************************************************************************/

#define PID_KP                  35.0f
#define PID_KD                  10.0f

#define SPEED_MAX               680
#define SPEED_MIN               260
#define SPEED_ERR_DECAY         22.0f
#define SPEED_INIT              400.0f

#define TURN_LIMIT              600

#define ERR_OUTER               2.5f
#define ERR_INNER               0.45f

#define TURN_GAIN_K             0.9f

#define ERR_FILTER_OLD          0.65f
#define ERR_FILTER_NEW          0.35f
#define SPEED_FILTER_OLD        0.75f
#define SPEED_FILTER_NEW        0.25f
#define TURN_FILTER_OLD         0.55f
#define TURN_FILTER_NEW         0.45f
#define MOTOR_FILTER_OLD        0.15f
#define MOTOR_FILTER_NEW        0.85f

#define CURVE_REVERSE_ERR       1.0f
#define CURVE_REVERSE_POS       1
#define CURVE_INNER_REVERSE    -260
#define CURVE_MIN_TURN_EXTRA    60
#define CURVE_MID_INNER_REVERSE -120
#define CURVE_MID_TURN_EXTRA    20

#define PATTERN_LEFT_OUTER      0x08
#define PATTERN_LEFT_HEAVY      0x0C
#define PATTERN_LEFT_INNER      0x04
#define PATTERN_RIGHT_INNER     0x02
#define PATTERN_RIGHT_HEAVY     0x03
#define PATTERN_RIGHT_OUTER     0x01

#define D_LIMIT                 0.8f
#define SENSOR_STABLE_COUNT     0
#define LOST_HOLD_COUNT         3
#define LOST_FAST_OUTER         600
#define LOST_FAST_INNER        -200
#define MOTOR_LIMIT             650
#define LOOP_DELAY_MS           5

#define USART1_BAUDRATE         38400

static int clamp(int v, int min, int max)
{
    if (v > max) return max;
    if (v < min) return min;
    return v;
}

static float sm_l = 0, sm_r = 0;

static void MotorOut(int l, int r)
{
    l = clamp(l, -MOTOR_LIMIT, MOTOR_LIMIT);
    r = clamp(r, -MOTOR_LIMIT, MOTOR_LIMIT);
    sm_l = sm_l * MOTOR_FILTER_OLD + l * MOTOR_FILTER_NEW;
    sm_r = sm_r * MOTOR_FILTER_OLD + r * MOTOR_FILTER_NEW;

    if (sm_l >= 0)
    {
        Motor1_SetSpeed(0, (int)sm_l);
        Motor4_SetSpeed(0, (int)sm_l);
    }
    else
    {
        Motor1_SetSpeed(1, (int)(-sm_l));
        Motor4_SetSpeed(1, (int)(-sm_l));
    }

    if (sm_r >= 0)
    {
        Motor2_SetSpeed(0, (int)sm_r);
        Motor3_SetSpeed(0, (int)sm_r);
    }
    else
    {
        Motor2_SetSpeed(1, (int)(-sm_r));
        Motor3_SetSpeed(1, (int)(-sm_r));
    }
}

