0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
        /* Motor motion is permitted.  Update diagnostic state to arm
           exactly once on the transition from inhibited → running. */
        diag_one_shot_update(&g_diag_state, 0);

        /* 读取IMU。Task 4B-4 fix: yaw dt 用相邻采样的真实单调时间差，
           并做边界保护（零 dt → 1ms；异常大间隔 → 100ms）。 */
        {
            s_timing_work.t_imu_start_ms = mono_now_ms();
            uint32_t now_ms = mono_now_ms();
            uint32_t raw_dt_ms = mono_elapsed_ms(s_last_yaw_ms, now_ms);
            uint32_t dt_ms = raw_dt_ms;
            uint8_t dt_clamped = (raw_dt_ms < YAW_DT_MIN_MS ||
                                  raw_dt_ms > YAW_DT_MAX_MS) ? 1U : 0U;
            dt_ms = mono_clamp_dt_ms(dt_ms, YAW_DT_MIN_MS, YAW_DT_MAX_MS);
            s_last_yaw_ms = now_ms;
            MPU6050_SetDtClamped(dt_clamped);
            MPU6050_ReadAll();
            s_timing_work.t_imu_done_ms = mono_now_ms();
            MPU6050_UpdateYaw((float)dt_ms / 1000.0f);
        }


        uint8_t b0 = !Sensor0_Get_State();
        uint8_t b1 = !Sensor1_Get_State();
        uint8_t b2 = !Sensor2_Get_State();
        uint8_t b3 = !Sensor3_Get_State();
        s_timing_work.t_sensor_done_ms = mono_now_ms();

        uint8_t pattern = (b0 << 3) | (b1 << 2) | (b2 << 1) | b3;
        if (pattern == last_pattern)
        {
            if (same_count < 5) same_count++;
        }
        else
        {
            same_count = 0;
            last_pattern = pattern;
        }
#if SENSOR_STABLE_COUNT == 0
        stable_pattern = pattern;
#else
        if (same_count >= SENSOR_STABLE_COUNT)
        {
            stable_pattern = pattern;
        }
#endif
        b0 = (stable_pattern >> 3) & 1;
        b1 = (stable_pattern >> 2) & 1;
        b2 = (stable_pattern >> 1) & 1;
        b3 = stable_pattern & 1;

        int black = b0 + b1 + b2 + b3;
        int pos = 0;
        if (b0) pos -= 3;
        if (b1) pos -= 1;
        if (b2) pos += 1;
        if (b3) pos += 3;

        if (black == 0)
        {
            lost_step++;

            /* Task 2B: report line-loss to protocol module.
               Task 4B-4 fix: 传入真实单调毫秒（不再依赖 g_loop_count*5ms）。
               If cumulative loss exceeds TWIN_CONTROL_LINE_LOST_MAX_MS,
               a hard stop is triggered — motors are zeroed IMMEDIATELY
               in this same iteration (no one-loop delay). */
            if (twin_control_report_line_lost(mono_now_ms())) {
                MotorTargetsZero();
                if (telemetry_rate_due(mono_now_ms(), s_last_telemetry_ms)) {
                    s_last_telemetry_ms = mono_now_ms();
                    Telemetry_Queue(0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                    (int32_t)(mpu_data.yaw * 100),
                                    MPU6050_GetValidityFlags());
                }
                ESP_FlushAfterControl();
                Delay_ms(LOOP_DELAY_MS);
                continue;
            }

            if (lost_step < LOST_HOLD_COUNT)
            {
                MotorOut((int)sm_l, (int)sm_r);
                Diag_CaptureAndSendOnce();
            }
            else if (last_dir > 0)
            {
                MotorOut(LOST_FAST_OUTER, LOST_FAST_INNER);
                Diag_CaptureAndSendOnce();
            }
            else
            {
                MotorOut(LOST_FAST_INNER, LOST_FAST_OUTER);
                Diag_CaptureAndSendOnce();
            }

            if (telemetry_rate_due(mono_now_ms(), s_last_telemetry_ms)) {
                s_last_telemetry_ms = mono_now_ms();
                Telemetry_Queue(0, 0, 0, 0,
                                (int16_t)sm_l, (int16_t)sm_r,
                                (int16_t)sm_r, (int16_t)sm_l,
                                0, 0,
                                (int32_t)(mpu_data.yaw * 100),
                                MPU6050_GetValidityFlags());
            }

            ESP_FlushAfterControl();
            Delay_ms(LOOP_DELAY_MS);
            continue;
        }

        lost_step = 0;

        /* Task 2B: line re-acquired — reset line-loss timer. */
        twin_control_report_line_found();

        {
            float error = 0;

            if (black == 4)
            {
                error = sm_err;
            }
            else if (black == 1)
            {
                if (b0)      error = -ERR_OUTER;
                else if (b1) error = -ERR_INNER;
                else if (b2) error =  ERR_INNER;
                else if (b3) error =  ERR_OUTER;
            }
            else
            {
                error = (float)pos / black;
            }

            sm_err = sm_err * ERR_FILTER_OLD + error * ERR_FILTER_NEW;
            error = sm_err;

            float d = error - last_err;
            if (d > D_LIMIT) d = D_LIMIT;
            if (d < -D_LIMIT) d = -D_LIMIT;
            last_err = error;

            float abs_error = (error > 0) ? error : -error;
            float turn_gain = 1.0f + abs_error * TURN_GAIN_K;

            integral_error += error * ((float)LOOP_DELAY_MS / 1000.0f);
            if (integral_error > 100.0f) integral_error = 100.0f;
            if (integral_error < -100.0f) integral_error = -100.0f;
            float pid = (active_params.kp * error + active_params.ki * integral_error +
                         active_params.kd * d) * turn_gain;

            int target_speed = (int)(active_params.speed_max - abs_error * SPEED_ERR_DECAY);
            target_speed = clamp(target_speed, SPEED_MIN, active_params.speed_max);

            int target_turn = (int)pid;
            target_turn = clamp(target_turn, -TURN_LIMIT, TURN_LIMIT);

            sm_speed = sm_speed * SPEED_FILTER_OLD + target_speed * SPEED_FILTER_NEW;
            sm_turn  = sm_turn  * TURN_FILTER_OLD + target_turn  * TURN_FILTER_NEW;

            int speed = (int)sm_speed;
            int turn  = (int)sm_turn;
            int curve_reverse = 0;

            switch (stable_pattern)
            {
                case PATTERN_LEFT_OUTER:
                case PATTERN_LEFT_HEAVY:
                {
                    int force_turn;
                    curve_reverse = 1;
                    speed = clamp(SPEED_MIN, SPEED_MIN, active_params.speed_max);
                    force_turn = speed - CURVE_INNER_REVERSE + CURVE_MIN_TURN_EXTRA;
                    turn = -force_turn;
                    break;
                }
                case PATTERN_LEFT_INNER:
                {
                    int force_turn;
                    curve_reverse = 1;
                    speed = clamp(SPEED_MIN, SPEED_MIN, active_params.speed_max);
                    force_turn = speed - CURVE_MID_INNER_REVERSE + CURVE_MID_TURN_EXTRA;
                    turn = -force_turn;
                    break;
                }
                case PATTERN_RIGHT_INNER:
                {
                    int force_turn;
                    curve_reverse = 1;
                    speed = clamp(SPEED_MIN, SPEED_MIN, active_params.speed_max);
                    force_turn = speed - CURVE_MID_INNER_REVERSE + CURVE_MID_TURN_EXTRA;
                    turn = force_turn;
                    break;
                }
                case PATTERN_RIGHT_HEAVY:
                case PATTERN_RIGHT_OUTER:
                {
                    int force_turn;
                    curve_reverse = 1;
                    speed = clamp(SPEED_MIN, SPEED_MIN, active_params.speed_max);
                    force_turn = speed - CURVE_INNER_REVERSE + CURVE_MIN_TURN_EXTRA;
                    turn = force_turn;
                    break;
                }
                default:
                    break;
            }

            int left  = speed + turn;
            int right = speed - turn;

            if (curve_reverse)
            {
                left  = clamp(left,  CURVE_INNER_REVERSE, MOTOR_LIMIT);
                right = clamp(right, CURVE_INNER_REVERSE, MOTOR_LIMIT);
            }
            else
            {
                left  = clamp(left,  20, MOTOR_LIMIT);
                right = clamp(right, 20, MOTOR_LIMIT);
            }

            if (pos != 0)
                last_dir = (pos > 0) ? 1 : -1;

            MotorOut(left, right);
            Diag_CaptureAndSendOnce();

            if (telemetry_rate_due(mono_now_ms(), s_last_telemetry_ms)) {
                s_last_telemetry_ms = mono_now_ms();
                Telemetry_Queue(b0, b1, b2, b3,
                                (int16_t)sm_l, (int16_t)sm_r,
                                (int16_t)sm_r, (int16_t)sm_l,
                                 (int16_t)(error * 100), (int16_t)pid,
                                 (int32_t)(mpu_data.yaw * 100),
                                 MPU6050_GetValidityFlags());
            }
        }

        ESP_FlushAfterControl();
        Delay_ms(LOOP_DELAY_MS);
    }
}
